########################################################################################################################
### 데이터 적재 및 IMPORT 패키지
########################################################################################################################
import pandas as pd
import sqlite3
import os
from sqlalchemy import create_engine

########################################################################################################################
### DB 연결
########################################################################################################################
# 일반연결
conn = sqlite3.connect("pine.db", isolation_level=None)
cur  = conn.cursor()

# SQLAlchemy 연결
engine = create_engine('sqlite:///pine.db')
conn2  = engine.connect()

########################################################################################################################
### 피처마트 DDL
########################################################################################################################

input_str='FTRMART'
cur.execute(f"""drop table if exists {input_str} WHERE 기준년월 ='{baseYM}'""")
cur.execute(f"""
    create table if not exists {input_str} (
         기준년월                                                     TEXT
        ,회원번호                                                     INT
        ,성별                                                         TEXT
        ,나이                                                         INT
        ,나이범주                                                     TEXT
        ,학력                                                         TEXT
        ,직업군                                                       TEXT
        ,고객군                                                       INT
        ,통근거리                                                     DOUBLE
        ,결혼여부                                                     TEXT
        ,애완동물                                                     TEXT
        ,가족구성원수                                                 INT
        ,가족구성원수범주                                             TEXT
        ,대륙코드                                                     INT
        ,국가명                                                       INT
        ,주명                                                         INT
        ,모기지액수                                                   INT
        ,모기지액수범주                                               TEXT
        ,소유모기지수                                                 INT
        ,소유차량수                                                   INT
        ,소유차량수범주                                               TEXT
        ,계좌잔액                                                     INT
        ,계좌잔액범주                                                 TEXT
        ,전임근무                                                     TEXT
        ,연봉                                                         INT
        ,연봉범주                                                     TEXT
        ,연봉구간                                                     TEXT
        ,자가소유형태                                                 TEXT
        ,잔액부족횟수                                                 INT
        ,모기지납입지연횟수                                           INT
        ,모기지납입지연횟수범주                                       TEXT
        ,월별애니시청여부                                             INT
        ,월별드라마시청여부                                           INT
        ,월별역사시청여부                                             INT
        ,월별코미디시청여부                                           INT
        ,월별액션시청여부                                             INT
        ,월별범죄시청여부                                             INT
        ,월별스릴러시청여부                                           INT
        ,월별다큐시청여부                                             INT
        ,월별모험시청여부                                             INT
        ,월별판타지시청여부                                           INT
        ,월별가족시청여부                                             INT
        ,월별로맨스시청여부                                           INT
        ,월별음악시청여부                                             INT
        ,월별호러시청여부                                             INT
        ,월별전쟁시청여부                                             INT
        ,월별서부시청여부                                             INT
        ,월별미스테리시청여부                                         INT
        ,월별단편시청여부                                             INT
        ,월별뮤지컬시청여부                                           INT
        ,월별스포츠시청여부                                           INT
        ,월별공상과학시청여부                                         INT
        ,월별전기시청여부                                             INT
        ,월별뉴스시청여부                                             INT
        ,월별평점평균                                                 DOUBLE
        ,월별판매금액평균                                             DOUBLE
        ,월별평점총합                                                 INT
        ,월별판매금액총합                                             DOUBLE
        ,월별시청횟수                                                 INT
        ,월별탐색횟수                                                 INT
        ,월별만족횟수                                                 INT
        ,월별불만족횟수                                               INT
        ,월별시청평균                                                 DOUBLE
        ,월별탐색평균                                                 DOUBLE
        ,월별만족평균                                                 DOUBLE
        ,월별불만족평균                                               DOUBLE
        ,월별시청흥행액평균                                           DOUBLE
        ,월별시청예산액평균                                           DOUBLE
        ,월별시청흥행액총액                                           INT
        ,월별시청예산액총액                                           INT
        ,월별애니판매금액총액                                         DOUBLE
        ,월별드라마판매금액총액                                       DOUBLE
        ,월별역사판매금액총액                                         DOUBLE
        ,월별코미디판매금액총액                                       DOUBLE
        ,월별액션판매금액총액                                         DOUBLE
        ,월별범죄판매금액총액                                         DOUBLE
        ,월별스릴러판매금액총액                                       DOUBLE
        ,월별다큐판매금액총액                                         DOUBLE
        ,월별모험판매금액총액                                         DOUBLE
        ,월별판타지판매금액총액                                       DOUBLE
        ,월별가족판매금액총액                                         DOUBLE
        ,월별로맨스판매금액총액                                       DOUBLE
        ,월별음악판매금액총액                                         DOUBLE
        ,월별호러판매금액총액                                         DOUBLE
        ,월별전쟁판매금액총액                                         DOUBLE
        ,월별서부판매금액총액                                         DOUBLE
        ,월별미스테리판매금액총액                                     DOUBLE
        ,월별단편판매금액총액                                         DOUBLE
        ,월별뮤지컬판매금액총액                                       DOUBLE
        ,월별스포츠판매금액총액                                       DOUBLE
        ,월별공상과학판매금액총액                                     DOUBLE
        ,월별전기판매금액총액                                         DOUBLE
        ,월별뉴스판매금액총액                                         DOUBLE
        ,월별애니판매금액평균                                         DOUBLE
        ,월별드라마판매금액평균                                       DOUBLE
        ,월별역사판매금액평균                                         DOUBLE
        ,월별코미디판매금액평균                                       DOUBLE
        ,월별액션판매금액평균                                         DOUBLE
        ,월별범죄판매금액평균                                         DOUBLE
        ,월별스릴러판매금액평균                                       DOUBLE
        ,월별다큐판매금액평균                                         DOUBLE
        ,월별모험판매금액평균                                         DOUBLE
        ,월별판타지판매금액평균                                       DOUBLE
        ,월별가족판매금액평균                                         DOUBLE
        ,월별로맨스판매금액평균                                       DOUBLE
        ,월별음악판매금액평균                                         DOUBLE
        ,월별호러판매금액평균                                         DOUBLE
        ,월별전쟁판매금액평균                                         DOUBLE
        ,월별서부판매금액평균                                         DOUBLE
        ,월별미스테리판매금액평균                                     DOUBLE
        ,월별단편판매금액평균                                         DOUBLE
        ,월별뮤지컬판매금액평균                                       DOUBLE
        ,월별스포츠판매금액평균                                       DOUBLE
        ,월별공상과학판매금액평균                                     DOUBLE
        ,월별전기판매금액평균                                         DOUBLE
        ,월별뉴스판매금액평균                                         DOUBLE
        ,월별애니시청횟수                                             INT
        ,월별애니탐색횟수                                             INT
        ,월별드라마시청횟수                                           INT
        ,월별드라마탐색횟수                                           INT
        ,월별역사시청횟수                                             INT
        ,월별역사탐색횟수                                             INT
        ,월별코미디시청횟수                                           INT
        ,월별코미디탐색횟수                                           INT
        ,월별액션시청횟수                                             INT
        ,월별액션탐색횟수                                             INT
        ,월별범죄시청횟수                                             INT
        ,월별범죄탐색횟수                                             INT
        ,월별스릴러시청횟수                                           INT
        ,월별스릴러탐색횟수                                           INT
        ,월별다큐시청횟수                                             INT
        ,월별다큐탐색횟수                                             INT
        ,월별모험시청횟수                                             INT
        ,월별모험탐색횟수                                             INT
        ,월별판타지시청횟수                                           INT
        ,월별판타지탐색횟수                                           INT
        ,월별가족시청횟수                                             INT
        ,월별가족탐색횟수                                             INT
        ,월별로맨스시청횟수                                           INT
        ,월별로맨스탐색횟수                                           INT
        ,월별음악시청횟수                                             INT
        ,월별음악탐색횟수                                             INT
        ,월별호러시청횟수                                             INT
        ,월별호러탐색횟수                                             INT
        ,월별전쟁시청횟수                                             INT
        ,월별전쟁탐색횟수                                             INT
        ,월별서부시청횟수                                             INT
        ,월별서부탐색횟수                                             INT
        ,월별미스테리시청횟수                                         INT
        ,월별미스테리탐색횟수                                         INT
        ,월별단편시청횟수                                             INT
        ,월별단편탐색횟수                                             INT
        ,월별뮤지컬시청횟수                                           INT
        ,월별뮤지컬탐색횟수                                           INT
        ,월별스포츠시청횟수                                           INT
        ,월별스포츠탐색횟수                                           INT
        ,월별공상과학시청횟수                                         INT
        ,월별공상과학탐색횟수                                         INT
        ,월별전기시청횟수                                             INT
        ,월별전기탐색횟수                                             INT
        ,월별뉴스시청횟수                                             INT
        ,월별뉴스탐색횟수                                             INT
        ,월별애니추천횟수                                             INT
        ,월별애니만족횟수                                             INT
        ,월별드라마추천횟수                                           INT
        ,월별드라마만족횟수                                           INT
        ,월별역사추천횟수                                             INT
        ,월별역사만족횟수                                             INT
        ,월별코미디추천횟수                                           INT
        ,월별코미디만족횟수                                           INT
        ,월별액션추천횟수                                             INT
        ,월별액션만족횟수                                             INT
        ,월별범죄추천횟수                                             INT
        ,월별범죄만족횟수                                             INT
        ,월별스릴러추천횟수                                           INT
        ,월별스릴러만족횟수                                           INT
        ,월별다큐추천횟수                                             INT
        ,월별다큐만족횟수                                             INT
        ,월별모험추천횟수                                             INT
        ,월별모험만족횟수                                             INT
        ,월별판타지추천횟수                                           INT
        ,월별판타지만족횟수                                           INT
        ,월별가족추천횟수                                             INT
        ,월별가족만족횟수                                             INT
        ,월별로맨스추천횟수                                           INT
        ,월별로맨스만족횟수                                           INT
        ,월별음악추천횟수                                             INT
        ,월별음악만족횟수                                             INT
        ,월별호러추천횟수                                             INT
        ,월별호러만족횟수                                             INT
        ,월별전쟁추천횟수                                             INT
        ,월별전쟁만족횟수                                             INT
        ,월별서부추천횟수                                             INT
        ,월별서부만족횟수                                             INT
        ,월별미스테리추천횟수                                         INT
        ,월별미스테리만족횟수                                         INT
        ,월별단편추천횟수                                             INT
        ,월별단편만족횟수                                             INT
        ,월별뮤지컬추천횟수                                           INT
        ,월별뮤지컬만족횟수                                           INT
        ,월별스포츠추천횟수                                           INT
        ,월별스포츠만족횟수                                           INT
        ,월별공상과학추천횟수                                         INT
        ,월별공상과학만족횟수                                         INT
        ,월별전기추천횟수                                             INT
        ,월별전기만족횟수                                             INT
        ,월별뉴스추천횟수                                             INT
        ,월별뉴스만족횟수                                             INT
        ,월별애니불만족횟수                                           INT
        ,월별드라마불만족횟수                                         INT
        ,월별역사불만족횟수                                           INT
        ,월별코미디불만족횟수                                         INT
        ,월별액션불만족횟수                                           INT
        ,월별범죄불만족횟수                                           INT
        ,월별스릴러불만족횟수                                         INT
        ,월별다큐불만족횟수                                           INT
        ,월별모험불만족횟수                                           INT
        ,월별판타지불만족횟수                                         INT
        ,월별가족불만족횟수                                           INT
        ,월별로맨스불만족횟수                                         INT
        ,월별음악불만족횟수                                           INT
        ,월별호러불만족횟수                                           INT
        ,월별전쟁불만족횟수                                           INT
        ,월별서부불만족횟수                                           INT
        ,월별미스테리불만족횟수                                       INT
        ,월별단편불만족횟수                                           INT
        ,월별뮤지컬불만족횟수                                         INT
        ,월별스포츠불만족횟수                                         INT
        ,월별공상과학불만족횟수                                       INT
        ,월별전기불만족횟수                                           INT
        ,월별뉴스불만족횟수                                           INT
        ,월별흥행0등급시청횟수                                        INT
        ,월별흥행1등급시청횟수                                        INT
        ,월별흥행2등급시청횟수                                        INT
        ,월별흥행3등급시청횟수                                        INT
        ,월별흥행4등급시청횟수                                        INT
        ,월별예산0등급시청횟수                                        INT
        ,월별예산1등급시청횟수                                        INT
        ,월별예산2등급시청횟수                                        INT
        ,월별예산3등급시청횟수                                        INT
        ,월별예산4등급시청횟수                                        INT
        ,월별1950이전시청횟수                                         INT
        ,월별1965이전시청횟수                                         INT
        ,월별1980이전시청횟수                                         INT
        ,월별1999이전시청횟수                                         INT
        ,월별2010이전시청횟수                                         INT
        ,월별2010이후시청횟수                                         INT
        ,PRIMARY KEY(기준년월, 회원번호) 
    )
"""
)

########################################################################################################################
#### 장르별 타겟마트 DDL 형성
########################################################################################################################
input_str='TRGTMART'
cur.execute(f"""drop table if exists {input_str}""")
cur.execute(f"""
    create table if not exists {input_str} (
         기준년월                                                     TEXT
        ,회원번호                                                     TEXT
        ,타겟년월                                                     TEXT
        ,Y_애니                                                       INT
        ,Y_드라마                                                     INT
        ,Y_역사                                                       INT
        ,Y_코미디                                                     INT
        ,Y_액션                                                       INT
        ,Y_범죄                                                       INT
        ,Y_스릴러                                                     INT
        ,Y_다큐                                                       INT
        ,Y_모험                                                       INT
        ,Y_판타지                                                     INT
        ,Y_가족                                                       INT
        ,Y_로맨스                                                     INT
        ,Y_음악                                                       INT
        ,Y_호러                                                       INT
        ,Y_전쟁                                                       INT
        ,Y_서부                                                       INT
        ,Y_미스테리                                                   INT
        ,Y_단편                                                       INT
        ,Y_뮤지컬                                                     INT
        ,Y_스포츠                                                     INT
        ,Y_공상과학                                                   INT
        ,Y_전기                                                       INT
        ,Y_뉴스                                                       INT
        ,나이                                                         INT
        ,성별                                                         TEXT
        ,결혼여부                                                     TEXT
        ,PRIMARY KEY(기준년월, 회원번호, 성별, 결혼여부) 
    )
"""

########################################################################################################################
#### 장르별 타겟마트(샘플링용) DDL 형성
########################################################################################################################

input_str ='TRGTMART_SUB'
cur.execute(f"""drop table if exists {input_str}""")
cur.execute(f"""
    create table if not exists {input_str} (
         기준년월                                                     TEXT
        ,회원번호                                                     TEXT
        ,장르명                                                       TEXT
        ,샘플구분                                                     INT
        ,Y                                                            INT
        ,PRIMARY KEY(기준년월, 회원번호, 샘플구분) 
    )
"""
)



########################################################################################################################
### 스코어마트 DDL
########################################################################################################################
input_str='SCRMART'

cur.execute(f"""drop table if exists {input_str}""")
cur.execute(f"""
    create table if not exists {input_str} (
         기준년월                                                     TEXT
        ,회원번호                                                     INT
     	,스코어														  DOUBLE
        ,PRIMARY KEY(기준년월, 회원번호) 
    )
"""
)

